<a href="https://colab.research.google.com/github/shinyumi43/deep-learning/blob/main/pandas_dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# https://3months.tistory.com/292 (출처)
# https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.at.html (출처)

# pandas dataframe(테이블 형식의 데이터를 다룰 때 사용) 만들기
from IPython.display import display
import numpy as np
import pandas as pd

In [ ]:
# dataframe에 대한 입력으로 2차원 배열 갖고 오기
my_2darray = np.array([[1,2,3],[4,5,6]]) # (2 X 3) 행렬 my_2darray 생성
display(pd.DataFrame(my_2darray)) #pd.DateFrame을 이용하여 pandas 데이터 타입으로 변환 후 display 함수를 통해 테이블 형식으로 출력

   0  1  2
0  1  2  3
1  4  5  6

In [ ]:
# dataframe에 대한 입력으로 딕셔너리 갖고 오기
my_dict = {"a" : ['1','3'], "b" : ['1','2'], "c" : ['2', '4']} # key 값이 열의 값으로 지정
display(pd.DataFrame(my_dict))

   a  b  c
0  1  1  2
1  3  2  4

In [ ]:
# dataframe에 대한 입력으로 dataframe 갖고 오기
df = pd.DataFrame(data=[[0, 2, 3], [0, 4, 1], [10, 20, 30]],
                  index=range(0,3), columns=['a', 'b', 'c']) # index는 행의 값을 의미
display(pd.DataFrame(df))

    a   b   c
0   0   2   3
1   0   4   1
2  10  20  30

In [ ]:
# dataframe에 대한 입력으로 series를 갖고 오기, series는 index가 있는 1차원 배열로 생각, 문자, 논리형, 숫자 모든 데이터 타입 삽입 가능
my_series = pd.Series({"United Kingdom":"London", "India":"New Delhi", "United States":"Washington", "Belgium":"Brussels"})
display(pd.DataFrame(my_series))

                         0
United Kingdom      London
India            New Delhi
United States   Washington
Belgium           Brussels

In [ ]:
# row와 column의 수 알아보기
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6]]))
print("(행, 열) :", df.shape)
print("index의 길이(행의 개수) :", len(df.index))
print("열 리스트 :", list(df.columns))

(행, 열) : (2, 3)
index의 길이(행의 개수) : 2
열 리스트 : [0, 1, 2]

In [ ]:
# 특정 column이나 row(index) 선택하기
df = pd.DataFrame({"A" : [1, 4, 7], "B" : [2, 5, 8], "C":[3, 6, 9]})

# iloc[]를 사용하여 행을 선택, [] 안에는 row(index) 값 지정
display(df.iloc[0]) # 첫 번째 행의 데이터와 해당 데이터의 열
print()
display(df.loc[1]) # 두 번째 행의 데이터와 해당 데이터의 열
print()

# loc[]을 사용하여 열을 선택
display(df.loc[0:1, 'B']) # [] 안에는 행의 개수, 불러올 열의 값 지정 
print()
display(df['A']) # 열의 값에 지정된 데이터와 해당 데이터의 행

A    1
B    2
C    3
Name: 0, dtype: int64

A    4
B    5
C    6
Name: 1, dtype: int64

0    2
1    5
Name: B, dtype: int64

0    1
1    4
2    7
Name: A, dtype: int64

In [ ]:
# dataframe에 index 추가하기
df = pd.DataFrame({"A" : [1, 4, 7], "B" : [2, 5, 8], "C" : [3, 6, 9]})
display(df)
print()

df = df.set_index('A') # index 값을 'A'열로 지정
display(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

   B  C
A
1  2  3
4  5  6
7  8  9

In [ ]:
# dataframe에 row 추가하기
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), index= [2.5, 12.6, 4.8], columns=[48, 49, 50])
display(df)
print()

# index = 2인 row를 만들고, 그곳에 값을 추가
df.loc[2] = [11, 12, 13]
display(df)

      48  49  50
2.5    1   2   3
12.6   4   5   6
4.8    7   8   9

      48  49  50
2.5    1   2   3
12.6   4   5   6
4.8    7   8   9
2.0   11  12  13

In [ ]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=[48, 49, 50])
display(df)
print()

# index를 신경쓰지 않고, 데이터의 가장 뒤에 row를 추가하고자 할 때 append 사용
a = pd.DataFrame(data=[[10, 11, 12]], columns=[48, 49, 50])
display(a)
print()

df = df.append(a)
df = df.reset_index(drop=True) # index를 0부터 새롭게 지정
display(df)

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9

   48  49  50
0  10  11  12

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [ ]:
# dataframe에 column 추가하기
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])
display(df)
print()

# [5, 6, 7]을 가진 'D'열을 생성
df.loc[:, 'D'] = pd.Series(['5', '6', '7'], index=df.index)
display(df)
print()

# [5, 6, 7]을 가진 'E'열을 생성
df['E'] = pd.Series(['8', '9', '10'], index=df.index)
display(df)
print()

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

   A  B  C  D
0  1  2  3  5
1  4  5  6  6
2  7  8  9  7

   A  B  C  D   E
0  1  2  3  5   8
1  4  5  6  6   9
2  7  8  9  7  10

In [ ]:
# dataframe에서 column 삭제하기
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])
display(df)
print()
              
# drop axis의 경우, column이면 1, row이면 0
df.drop('A', axis=1, inplace=True) # drop을 통해 column 전체 삭제 가능
display(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

   B  C
0  2  3
1  5  6
2  8  9

In [ ]:
# dataframe에서 row 삭제하기
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [40, 50, 60], [23, 35, 37]]), 
                  index= [2.5, 12.6, 4.8, 4.8, 2.5], 
                  columns=[48, 49, 50])
display(df)
print()

df = df.reset_index() # index 리셋
display(df)
print()

# drop_duplicate를 사용하면, 특정 column의 값이 중복된 row를 제거 가능
df = df.drop_duplicates(subset='index', keep='last').set_index('index') # keep을 통해 중복된 값들 중 제거하지 않고 유지할 값을 지정
display(df)

      48  49  50
2.5    1   2   3
12.6   4   5   6
4.8    7   8   9
4.8   40  50  60
2.5   23  35  37

   index  48  49  50
0    2.5   1   2   3
1   12.6   4   5   6
2    4.8   7   8   9
3    4.8  40  50  60
4    2.5  23  35  37

       48  49  50
index
12.6    4   5   6
4.8    40  50  60
2.5    23  35  37

In [ ]:
# index를 통한 row 삭제하기
df = pd.DataFrame(data=np.array([[1, 2, 3], [1, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])
display(df)
print()

# 삭제할 index를 출력
print(df.index[1])
print()

# drop을 통해 특정 index를 가진 row를 삭제
print(df.drop(df.index[1]))
print()
print(df.drop(0)) # df.index[] 없이 곧바로 지정

   A  B  C
0  1  2  3
1  1  5  6
2  7  8  9

1

   A  B  C
0  1  2  3
2  7  8  9

   A  B  C
1  1  5  6
2  7  8  9

In [ ]:
# dataframe에서 데이터 수정하기
df = pd.DataFrame(data=np.array([[1, 2, 3], [1, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])
display(df)
print()

# iloc이나 loc을 이용해서 row, column의 값 지정 후 수정 가능
df.iloc[0]['A'] = 0
df.loc[2]['C'] = 10
display(df)

   A  B  C
0  1  2  3
1  1  5  6
2  7  8  9

   A  B   C
0  0  2   3
1  1  5   6
2  7  8  10